Revit 2026 API

# CurveByPointsUtilsCreateRectangle Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void CreateRectangle(
	Document document,
	ReferencePoint startPoint,
	ReferencePoint endPoint,
	CurveProjectionType projectionType,
	bool boundaryReferenceLines,
	bool boundaryCurvesFollowSurface,
	out IList<ElementId> createdCurvesIds,
	out IList<ElementId> createdCornersIds
)
```
```vb
Public Shared Sub CreateRectangle (
	document As Document,
	startPoint As ReferencePoint,
	endPoint As ReferencePoint,
	projectionType As CurveProjectionType,
	boundaryReferenceLines As Boolean,
	boundaryCurvesFollowSurface As Boolean,
	<OutAttribute> ByRef createdCurvesIds As IList(Of ElementId),
	<OutAttribute> ByRef createdCornersIds As IList(Of ElementId)
)
```
```cpp
public:
static void CreateRectangle(
	Document^ document,
	ReferencePoint^ startPoint,
	ReferencePoint^ endPoint,
	CurveProjectionType projectionType,
	bool boundaryReferenceLines,
	bool boundaryCurvesFollowSurface,
	[OutAttribute] IList<ElementId^>^% createdCurvesIds,
	[OutAttribute] IList<ElementId^>^% createdCornersIds
)
```
```fsharp
static member CreateRectangle :
        document : Document *
        startPoint : ReferencePoint *
        endPoint : ReferencePoint *
        projectionType : CurveProjectionType *
        boundaryReferenceLines : bool *
        boundaryCurvesFollowSurface : bool *
        createdCurvesIds : IList<ElementId> byref *
        createdCornersIds : IList<ElementId> byref -> unit
```

#### Parameters

document Document

startPoint ReferencePoint

endPoint ReferencePoint

projectionType CurveProjectionType

boundaryReferenceLines Boolean

boundaryCurvesFollowSurface Boolean

createdCurvesIds IListElementId

createdCornersIds IListElementId

#### Reference

CurveByPointsUtils Class

Autodesk.Revit.DB Namespace